'''

Условие
Дано положительное действительное число X. Выведите его дробную часть. 

'''

import math

x = float(input())
x1 = math.floor(x)
print(x-x1)
