'''

Условие
Дано натуральное число. Найдите число десятков в его десятичной записи. 

'''

a = input()
a1 = []
for i in a:
	a1+=i
if len(a1) >= 2:
    print(a1[-2])
elif len(a1) == 1:
    print(0)
