'''

Условие

Шахматный конь ходит буквой “Г” — на две клетки по вертикали в любом направлении и на одну клетку по горизонтали, или наоборот. 
Даны две различные клетки шахматной доски, определите, может ли конь попасть с первой клетки на вторую одним ходом.

'''

a = int(input())
b = int(input())
a1 = int(input())
b1 = int(input())
if (a1 == a+1 or a1 == a-1) and (b1 == b+2 or b1 == b-2):
    print("YES")
elif (a1 == a-2 or a1 == a+2) and (b1 == b-1 or b1 == b+1):
    print("YES")
else:
    print("NO")
