'''

Условие
Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!). 

'''

a = int(input())
b = a + 1
c = a - 1
print('The next number for the number', a, 'is', b)
print('The previous number for the number', a, 'is', c)
